{
  "irVersion": "1.0",
  "project": "omniagent",
  "repository": "https://github.com/plexusone/omniagent",
  "versioning": "semver",
  "commitConvention": "conventional",
  "maintainers": ["plexusone", "johncwang@gmail.com"],
  "releases": [
    {
      "version": "v0.4.0",
      "date": "2026-03-01",
      "highlights": [
        { "description": "Module migration from agentplexus to plexusone organization" },
        { "description": "Batteries-included omnivoice with provider registry pattern" }
      ],
      "changed": [
        { "description": "Module path migrated from `github.com/agentplexus/omniagent` to `github.com/plexusone/omniagent`" },
        { "description": "Voice processor refactored to use `omnivoice.GetSTTProvider()` and `omnivoice.GetTTSProvider()` registry pattern" },
        { "description": "Removed direct `omnivoice-deepgram` import - now auto-registered via `providers/all`" }
      ],
      "dependencies": [
        { "description": "Upgrade `github.com/plexusone/omnivoice` to v0.5.1 (batteries-included with registry)" },
        { "description": "Upgrade `github.com/plexusone/omnichat` to v0.3.0" },
        { "description": "Upgrade `github.com/plexusone/omnillm` to v0.13.0" },
        { "description": "Upgrade `github.com/plexusone/omniobserve` to v0.7.0" },
        { "description": "Upgrade `github.com/plexusone/omniserp` to v0.8.0" }
      ]
    },
    {
      "version": "v0.3.0",
      "date": "2026-02-22",
      "highlights": [
        { "description": "Skill system with OpenClaw/ClawHub compatibility" },
        { "description": "WASM and Docker sandboxing for secure tool execution" }
      ],
      "added": [
        { "description": "`skills/` package with SKILL.md parser supporting YAML frontmatter and metadata", "commit": "72b7281" },
        { "description": "Skill discovery from multiple directories with deduplication", "commit": "72b7281" },
        { "description": "Requirement checking for skills (bins, env vars) with install hints", "commit": "72b7281" },
        { "description": "Skill injection into system prompt with emoji support", "commit": "72b7281" },
        { "description": "CLI commands: `skills list`, `skills info`, `skills check`", "commit": "72b7281" },
        { "description": "Agent integration with skill loading on startup", "commit": "72b7281" },
        { "description": "`sandbox/` package with capability-based permission model", "commit": "f1d3781" },
        { "description": "WASM runtime wrapper using wazero with memory limits and timeout enforcement", "commit": "f1d3781" },
        { "description": "Host functions for sandboxed file, HTTP, and command execution", "commit": "f1d3781" },
        { "description": "Docker sandbox with container isolation and security hardening", "commit": "f1d3781" },
        { "description": "Path validation with symlink resolution for sandbox security", "commit": "f1d3781" },
        { "description": "Command allowlist enforcement for exec operations", "commit": "f1d3781" }
      ],
      "fixed": [
        { "description": "Config tests now clear environment variables to prevent interference", "commit": "467d9dc" }
      ],
      "dependencies": [
        { "description": "Add `github.com/tetratelabs/wazero` v1.11.0 for WASM runtime", "commit": "ec40405" },
        { "description": "Add `github.com/moby/moby/client` v0.2.2 for Docker SDK", "commit": "ec40405" },
        { "description": "Add `github.com/moby/moby/api` v1.53.0 for Docker API types", "commit": "ec40405" }
      ]
    },
    {
      "version": "v0.2.0",
      "date": "2026-02-22",
      "highlights": [
        { "description": "Voice note support via OmniVoice integration for WhatsApp" }
      ],
      "added": [
        { "description": "`voice/` package with `Processor` implementing omnichat's `VoiceProcessor` interface", "commit": "b94f35e" },
        { "description": "Voice configuration in `config.go` with STT/TTS provider settings", "commit": "b94f35e" },
        { "description": "Environment variable support for voice config (`DEEPGRAM_API_KEY`, `OMNIAGENT_VOICE_*`)", "commit": "b94f35e" },
        { "description": "Gateway integration with `ProcessWithVoice` handler for voice-enabled messaging", "commit": "b94f35e" },
        { "description": "Deepgram provider support for both STT (nova-2) and TTS (aura-asteria-en)", "commit": "b94f35e" },
        { "description": "Response mode options: `auto` (voice reply to voice input), `always`, `never`", "commit": "b94f35e" }
      ],
      "dependencies": [
        { "description": "Add `github.com/plexusone/omnivoice` v0.4.3", "commit": "b94f35e" },
        { "description": "Add `github.com/plexusone/omnivoice-deepgram` v0.3.1", "commit": "b94f35e" },
        { "description": "Upgrade `github.com/plexusone/omnichat` to v0.2.0", "commit": "b94f35e" }
      ]
    },
    {
      "version": "v0.1.0",
      "date": "2026-02-22",
      "highlights": [
        { "description": "Initial release with WebSocket gateway, AI agent runtime, and unified messaging via omnichat" }
      ],
      "added": [
        { "description": "WebSocket gateway with client management and health checks", "commit": "da77c73" },
        { "description": "AI agent runtime with omnillm multi-provider support (OpenAI, Anthropic, Gemini)", "commit": "da77c73" },
        { "description": "Unified messaging via omnichat (WhatsApp, Telegram, Discord)", "commit": "ac7b21f" },
        { "description": "WhatsApp provider with QR code linking", "commit": "ac7b21f" },
        { "description": "LLM observability integration via omniobserve", "commit": "ac7b21f" },
        { "description": "Tool execution loop with max 5 iterations", "commit": "26e2cba" },
        { "description": "Web search tool via omniserp", "commit": "26e2cba" },
        { "description": "Browser automation tool using Rod", "commit": "da77c73" },
        { "description": "Shell execution tool with allowlist security", "commit": "da77c73" },
        { "description": "Cobra-based CLI with gateway, channels, config, and version commands", "commit": "da77c73" },
        { "description": "YAML/JSON configuration with environment variable overrides", "commit": "6295af1" },
        { "description": "CI/CD pipeline with multi-platform testing", "commit": "da77c73" }
      ],
      "fixed": [
        { "description": "Pin fetchup to v0.2.3 for go-rod/rod v0.116.2 compatibility", "commit": "de7f46d" },
        { "description": "Nil interface gotcha for observability hook when disabled", "commit": "ac7b21f" }
      ]
    }
  ]
}
